import 'package:flutter/material.dart';
import 'package:lunar/lunar.dart';

class BaziCalculator {
  static Map<String, String> getNineStarInfo(DateTime date) {
    Lunar lunar = Lunar.fromDate(date);
    NineStar nineStar = lunar.getDayNineStar();

    // Get the Chinese character representation
    String chineseNumber = nineStar.getNumber();

    // Map Chinese characters to numbers
    int starNumber;
    switch (chineseNumber) {
      case '一':
        starNumber = 1;
        break;
      case '二':
        starNumber = 2;
        break;
      case '三':
        starNumber = 3;
        break;
      case '四':
        starNumber = 4;
        break;
      case '五':
        starNumber = 5;
        break;
      case '六':
        starNumber = 6;
        break;
      case '七':
        starNumber = 7;
        break;
      case '八':
        starNumber = 8;
        break;
      case '九':
        starNumber = 9;
        break;
      default:
        starNumber = 9; // Default fallback
    }


    // Map of star information with more detailed data
    const Map<int, Map<String, String>> starInfo = {
      1: {
        'name': 'តារាលេខ1 ព័ណ៌ស \n一白水',
        'element': '水 ទឹក 🌊',
        'direction': 'ខាងជើង North',
        'color': 'ស រឺ ខ្មៅ ⬜ ⬛',
        'yinYang': 'អ៊ីន Yin',
        'luck': 'Kan (坎) ☵',
        'characteristics':
        'អ្នកមានតារាកំណើតលេខ១ជាអធិបតី គឺជាមនុស្សដែលមានក្តីសណ្តោសមេត្តា និងអាណិតអាសូរគេច្រើន។ អ្នកមានវិចារណញ្ញាណស៊ីជំរៅនិងខ្លាំងក្លាណាស់ ដោយសារអ្នកមានគំនិតពិចារណាល្អិតល្អន់ លទ្ធផលនៃការវិភាគរបស់អ្នកច្រើនតែត្រឹមត្រូវ។ អ្នកក៏មានសមត្ថភាពខ្ពស់ក្នុងការមើលមនុស្ស និងយល់ពីអារម្មណ៍របស់អ្នកដទៃ ម្លោះហើយអ្នកមានសមត្ថភាពក្នុងការជួយជ្រោមជ្រែងអ្នកដទៃឲ្យបានសម្រេចបំណង។',
        'advice': 'ធាតុទឹកនៃដួងតារាលេខ១នេះស្តែងចេញនូវភាពបត់បែន ងាយចុះចំណោមគេ មិនថាក្នុងការសិក្សា របររកស៊ី រឺសម្ព័ន្ធភាពស្នេហានោះទេ អ្នកងាយនឹងទទួលបានជោគជ័យដោយសារភាពងាយចុះសម្រុងរបស់អ្នកជាមួយអ្នកដទៃនិងដៃគូរជីវិត។ ពេលវេលាហេងចូលមកដល់ នឹងនាំមកនូវកេរ្តិ៍ឈ្មោះ ទ្រព្យសម្បត្តិ និងសុខភាពដ៏ប្រសើរ។ តែពេលឆុងគឺច្រើនតែនាំឲ្យគិតខុស១ពេល រឺជឿមនុសទុកចិត្តហើយគេក្បត់ ចូរប្រយ័ត្នចំនុចនេះ។'
      },
      2: {
        'name': 'តារាលេខ2 ព័ណ៌ខ្មៅ\n二黑土',
        'element': '土壤 ដី 🪨',
        'direction': 'និរតី Southwest',
        'color': 'ខ្មៅ ⬛',
        'yinYang': 'យ៉ាង Yang',
        'luck': 'Kun (坤) ☷',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ២ជាអធិបតី គឺជាមនុស្សដែលមានភាពអត់ធ្មត់ និងអាចពឹងពាក់បាន មនុស្សគេដើរតាមបាន។ អ្នកជាក្រុមមនុស្សដែលពូកែដោះស្រាយបញ្ហាបានយ៉ាងមានប្រសិទ្ធភាព សមត្ថភាពពិសេសរបស់អ្នកនេះគឺកម្រណាស់ដូច្នេះជីវិតនេះអ្នកសន្សំសុខបានច្រើន កុំឲ្យអ្នកណាបង្អាក់សមត្ថភាពរបស់អ្នកឲ្យសោះ។',
        'advice': 'ធាតុដីដ៏រឹងមាំរបស់អ្នក គឺជាទ្រនរដ៏រឹងមាំ និងប្រកបដោយជីជាតិ ដែលផ្តល់នូវជីវិតដ័ប្រសើរឲ្យអ្នកនិងអ្នកដែលពឹងពាក់អ្នក។ សុខភាពរឹងមាំ ចំណេះដឹងជ្រៅជ្រះ និងការរកស៊ីលូតលាស់ល្អគឺជាធាតុដ៏ប្រសើររបស់អ្នក។ ពេលវេលាហេងមកដល់ជំងឺអ្វីដ៏នឹងជាសះស្បើយ សុខភាពល្អបរិបូណ៌។ តែពេលឡាក់ឆុងមុខរបរមិនសូវជាប៉ះប៉ុន្មានទេ តែឆាប់ឈឺធ្ងន់ នឹងឆាប់ខ្សោយដោយមិនដឹងខ្លួន។'
      },
      3: {
        'name': 'តារាលេខ3 ព័ណ៌ហ្កិច\n三碧木',
        'element': '木头 ឈើ 🪵',
        'direction': 'ខាងកើត East',
        'color': 'ហ្កិច 🟩',
        'yinYang': 'អ៊ីន Yin',
        'luck': 'Zhen (震) ☳',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៣ជាអធិបតី គឺជាមនុស្សដែលមានថាមពល និងការច្នៃប្រឌិតខ្ពស់។ អ្នកពូកែផ្តួចផ្តើមគំនិត និងចេះរៀបគម្រោងនិងផែនការថ្មីៗ ម្លោះហើយបើកាន់ដំណែងជាអ្នកដឹកនាំ រឺបើកក្រុមហ៊ុនមុខរបររកស៊ីដោយខ្លួនឯងគឺប្រសើរ ព្រោះអ្នកមិនចេះទាល់គំនិតទេ។',
        'advice': 'អំណាចនៃធាតុឈើរបស់អ្នកនឹងផ្តល់នូវការលូតលាស់ឥតឈប់ឈរ អ្នកនឹងក្លាយជាអ្នកជំនួញរឺអ្នកមុខអ្នកការដែលទំនាក់ទំនងជាមួយអន្តរជាតិ រឺដៃគូរវិនិយោគដែលជាជនជាតិដទៃបានយ៉ាងងាយ។ ពេលវេលាហេង រាសីអ្នកខ្ពស់ អ្នកនិងមានមហិច្ចតាខ្ពស់ ពូកែវោហានិងភាសា ព្រមទាំងមានឈ្មោះល្បីល្បាញ។ តែពេលឡាក់ឆុងច្រើនមានជម្លោះទាក់ទងនិងរឿងអាស្រូវ និងការតតាំងផ្លូវច្បាប់។'
      },
      4: {
        'name': 'តារាលេខ4 ព័ណ៌បៃតង\n四祿木',
        'element': '木头 ឈើ 🌴',
        'direction': 'អាគ្នេយ៍ Southeast',
        'color': 'បៃតង 🟩',
        'yinYang': 'យ៉ាង Yang',
        'luck': 'Xun (巽) ☴',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៤ជាអធិបតី ជាមនុស្សដែលច្បាស់ការ អ្នកពួកែយកចិត្តទុកដាក់នូវរាល់កិច្ចការលម្អិត និងពូកែរៀបចំរចនាសម្ព័ន្ធបានយ៉ាងល្អ។ អ្នកគឺជាអ្នកគ្រប់គ្រងដ៏ល្អ ដោយមានសមត្ថភាពក្នុងការរៀបចំ និងគ្រប់គ្រងកិច្ចការផ្សេងៗប្រកបដោយប្រសិទ្ធភាពខ្ពស់។',
        'advice': 'ធាតុឈើរបស់អ្នកនឹងផ្តល់ឲ្យអ្នកនូវគំនិតច្នៃប្រឌិត និងពូកែពង្រីកមុខរបរការងារ។ ពេលវេលាហេងមកដល់អ្នកនឹងជោគជ័យរឿងស្នេហា ការច្នៃប្រឌិត និងពិសេសរៀនសូត្របានខ្ពស់ ព្រោះធាតុឈើនេះនឹងនាំមកនូវបញ្ញាឆ្លាតវៃ ភាពឧស្សាហ៍ព្យាយាម និងស្នេហាដ៏ផ្អែមល្ហែម។ ពេលឆុងច្រើនតែជួបមនុស្សទុកចិត្តក្បត់ខ្លួន ហើយនិងងាយមានរឿងអាស្រូវ។'
      },
      5: {
        'name': 'តារាលេខ5 ព័ណ៌លឿង\n五黃土',
        'element': '土壤 ដី 🪨',
        'direction': 'កណ្តាល Center',
        'color': 'លឿង 🟨',
        'yinYang': 'អ៊ីន Yin',
        'luck': 'ចំកណ្តាល ☯️',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៥ជាអធិបតី ជាមនុស្សដែលមានភាពអាចបត់បែនបានរហ័ស និងអាចរកឃើញផ្លូវកណ្តាលក្នុងជម្លោះផ្សេងៗ។ អ្នកមានសមត្ថភាពក្នុងការស្វែងរកដំណោះស្រាយដោយសន្សំក្តីសុខកាត់បន្ថយជំលោះយ៉ាងមានប្រសិទ្ធភាព។',
        'advice': 'អ្នកនិងមានទ្រព្យសម្បត្តិស្តុកស្តម្ភ សម្រេចសមិទ្ធផលបានច្រើនក្នុងជីវិត។ តែពេលឆុងច្រើនមានគ្រោះអាសន្នអន្តរាយទ្រង់ទ្រាយធំ រឿងអកុសលបាត់បង់របស់ជាទីស្រលាញ់។'
      },
      6: {
        'name': 'តារាលេខ6 ព័ណ៌ស\n六白金',
        'element': 'មាស 🪙',
        'direction': 'ពាយ័ព្យ Northwest',
        'color': 'ស រឺ មាស ⬜ 🟨',
        'yinYang': 'យ៉ាង Yang',
        'luck': 'Qian (乾) ☰',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៦ជាអធិបតី ជាមនុស្សដែលមានភាពយុត្តិធម៌ និងមានគុណតម្លៃខ្ពស់។ ពួកគេជាអ្នកផ្តល់ដំបូន្មានដ៏ល្អ ជាគ្រូបង្រៀនដ៏ចំណាន បើធ្វើការក្នុងវិស័យផ្សព្វផ្សាយគឺមានសមត្ថភាពណាស់ ពួកគេពូកែលើកទឹកចិត្ត និងអាចសង្គ្រោះដល់អ្នកដទៃបាន។',
        'advice': 'ធាតុដែករបស់អ្នកនឹងផ្តល់នូវដែនសមត្ថកិច្ច និងអំណាចទៅដល់អ្នក។ មនុស្សអ្នករឹងមាំណាស់មិនងាយធ្វើបែកទេ និយាយម៉ាត់ណាម៉ាត់ហ្នឹង មានអំណាច មានភាពជាអ្នកដឹកនាំ និងប្រកបដោយគុណតម្លៃ។ ពេលវេលាហេងមកដល់កាន់កិច្ចការធំ ដឹកនាំក្រុមមនុស្សច្រើនបានយ៉ាងមានប្រសិទ្ធិភាព។ ក្នុងវេលាឡាក់ឆុងច្រើនតែនៅម្នាក់ឯក មិនចង់ពឹងពាក់គេ ពេលខ្លះធ្វើឲ្យហួសពេល។'
      },
      7: {
        'name': 'តារាលេខ7 ព័ណ៌ក្រហម\n七赤金',
        'element': 'មាស 🪙',
        'direction': 'លិច West',
        'color': 'ក្រហម រឺ មាស 🧧 🟨',
        'yinYang': 'អ៊ីន Yin',
        'luck': 'Dui (兑) ☱',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៧ជាអធិបតី ជាមនុស្សដែលពូកែវិភាគ ពួកគេបើកាន់តំណែងជាទីប្រឹក្សា រឺក្រុមអ្នកវិភាគគឺល្អណាស់។ លទ្វផលនៃការវិភាគរបស់ពួកគេរមែងទទួលលទ្ធផលដូចដែលបានព្យាករណ៍។ ពួកគេជាអ្នកស្រាវជ្រាវដ៏ចំណាន ដោយមានសមត្ថភាពក្នុងការស្វែងរកព័ត៌មាន និងវិភាគសារពើភណ្ឌផ្សេងៗប្រកបដោយប្រសិទ្ធភាព។',
        'advice': 'ធាតុដែកដ៏មានតម្លៃនេះនឹងផ្តលឲ្យអ្នកនូវគុណសម្បត្តិនៃការប្រាស្រ័យទាក់ទងដ៏មានប្រសិទ្ធភាព ហើយរមែងផ្តល់នូវផ្លែផ្កា បើចរចារនិងគេ។ អ្នកនឹងមានទ្រព្យច្រើននៅថ្ងៃមុខ និងមានសុភមង្គល លើទ្រព្យសម្បត្តិនិងគ្រួសារ។ ពេលឡាក់ឆុងត្រូវប្រយ័ត្នរឿងចោប្លន់ ចោលួចទ្រព្យ និងគេបំបាត់បំភ័ន្ត។'
      },
      8: {
        'name': 'តារាលេខ8 ព័ណ៌ស\n八白土',
        'element': '土壤 ដី 🪨',
        'direction': 'ឦសាន Northeast',
        'color': 'ស រឺ លឿង ⬜ 🟨',
        'yinYang': 'យ៉ាង Yang',
        'luck': 'Gen (艮) ☶',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៨ជាអធិបតី ជាមនុស្សដែលមានភាពអត់ធ្មត់ និងមានសមត្ថភាពក្នុងការកសាងនូវអ្វីៗដែលពួកគេចង់បានដូចបំណង។ តារាហេងមួយនេះនឹងនាំទ្រព្យជូនម្ចាស់របស់ខ្លួន ទាំងទ្រព្យដោយផ្ទាល់ និងដោយប្រយោលមិនបានរំពឹងទុក្ខ។ អ្នកជាមនុស្សហេង។',
        'advice': 'ធាតុដីរបស់អ្នកតំណាងឲ្យភាពនឹងនរ និងធន់ រឹងមាំ គងវង្ស ហើយជោគជ័យយូរអង្វែង។ ពេលវេលាសមរម្យមកដល់ អ្នកនឹងទទូលបាននូវភាពឧត្តុង្គឧត្តមរុងរឿង ឋានៈខ្ពង់ខ្ពស់ និងស្មារតីមាំមួន។ ប៉ុន្តែខុសពេលឡាក់ឆុង អាចធ្វើឱ្យកូនចៅរងគ្រោះ ឬជួបនឹងមនុស្សក្បត់ជុំវិញខ្លួន។'
      },
      9: {
        'name': 'តារាលេខ9 ព័ណ៌ស្វាយ\n九紫火',
        'element': '火 ភ្លើង 🔥',
        'direction': 'ខាងត្បូង South',
        'color': 'ស្វាយ រឺ ក្រហម 🟪 🟥',
        'yinYang': 'អ៊ីន Yin',
        'luck': 'Li (离) ☲',
        'characteristics': 'អ្នកមានតារាកំណើតលេខ៩ជាអធិបតី ជាមនុស្សដែលមានភាពក្លាហាន និងអង់អាច។ ពួកគេមានថាមពលខ្ពស់ និងអាចបំផុសគំនិតផ្សេងៗដល់ហ្វូងមនុស្សគ្រប់ប្រភេទ។ ពួកគេមានសមត្ថភាពក្នុងការបង្កើតការផ្លាស់ប្តូរ និងជួយជ្រោមជ្រែងអ្នកដទៃផងដែរ។ ពួកគេមានចិត្តសប្បុរសធម៌ និងសមត្ថភាពក្នុងការបង្កើតការសម្រុះសម្រួលដើម្បីសម្រេចគោលដៅ។ កើតមកធ្វើជាមេគេ ជាប្រធានស្ថាប័ន រឺក្រុមហ៊ុនជាដើម។',
        'advice': 'ធាតុភ្លើងដ័ស័ក្តិសិទ្ធរបស់អ្នកគឺជាអាវុធដ៏មានតម្លៃ ធាតុភ្លើងនេះក៏ជាតំណាងចំណង់ចំណូលចិត្ត និងការបំភ្លឺផ្លូវ។ ពេលហេង គឺនឹងនាំមកនូវសេចក្តីរុងរឿងដ៏សម្បើម ឡើងឋានៈខ្ពស់។ តែបើឡាក់ឆុង អាចបណ្តាលឱ្យមានគ្រោះថ្នាក់ភ្លើងឆេះ ឬការកើតរឿងហេតុដែលមិនអាចគ្រប់គ្រងស្ថានការណ៍បាន ដែលនាំមកនូវវិប្បដិសារី។'
      },
    };

    // Get the info for the current star number
    Map<String, String> currentStarInfo = starInfo[starNumber]!;

    return {
      'starNumber': starNumber.toString(),
      'name': starInfo[starNumber]!['name']!,
      'element': starInfo[starNumber]!['element']!,
      'direction': starInfo[starNumber]!['direction']!,
      'color': starInfo[starNumber]!['color']!,
      'yinYang': starInfo[starNumber]!['yinYang']!,
      'luck': starInfo[starNumber]!['luck']!,
      'characteristics': starInfo[starNumber]!['characteristics']!,
      'advice': starInfo[starNumber]!['advice']!,
    };
  }

  static Map<String, List<String>> getAstroData(
      DateTime date, TimeOfDay time) {
    // Create combined DateTime with hour and minute
    DateTime dt = DateTime(
      date.year,
      date.month,
      date.day,
      time.hour,
      time.minute,
    );
    Lunar lunar = Lunar.fromDate(dt);
    EightChar eightChar = lunar.getEightChar();
    return {
      'Hour': _getPillarData(eightChar.getTimeGan(), eightChar.getTimeZhi()),
      'Day': _getPillarData(eightChar.getDayGan(), eightChar.getDayZhi()),
      'Month': _getPillarData(eightChar.getMonthGan(), eightChar.getMonthZhi()),
      'Year': _getPillarData(eightChar.getYearGan(), eightChar.getYearZhi()),
    };
  }

  static List<String> _getPillarData(String gan, String zhi) {
    return [
      gan,
      zhi,
      _getHiddenStems(zhi),
      _getNaYin(gan, zhi),
      _getStars(gan, zhi),
    ];
  }

  static String _getHiddenStems(String zhi) {
    const hiddenStemsMap = {
      '子': '癸',
      '丑': '己癸辛',
      '寅': '甲丙戊',
      '卯': '乙',
      '辰': '戊乙癸',
      '巳': '丙戊庚',
      '午': '丁己',
      '未': '己丁乙',
      '申': '庚壬戊',
      '酉': '辛',
      '戌': '戊辛丁',
      '亥': '壬甲',
    };
    return hiddenStemsMap[zhi] ?? 'Unknown';
  }

  static String _getNaYin(String gan, String zhi) {
    const naYinMap = {
      '甲子': '海中金',
      '乙丑': '海中金',
      '丙寅': '炉中火',
      '丁卯': '炉中火',
      '戊辰': '大林木',
      '己巳': '大林木',
      '庚午': '路旁土',
      '辛未': '路旁土',
      '壬申': '剑锋金',
      '癸酉': '剑锋金',
      '甲戌': '山头火',
      '乙亥': '山头火',
      '丙子': '涧下水',
      '丁丑': '澗下水',
      '戊寅': '城头土',
      '己卯': '城头土',
      '庚辰': '白蜡金',
      '辛巳': '白蜡金',
      '壬午': '杨柳木',
      '癸未': '杨柳木',
      '甲申': '泉中水',
      '乙酉': '泉中水',
      '丙戌': '屋上土',
      '丁亥': '屋上土',
      '戊子': '霹雳火',
      '己丑': '霹雳火',
      '庚寅': '松柏木',
      '辛卯': '松柏木',
      '壬辰': '长流水',
      '癸巳': '长流水',
      '甲午': '砂石金',
      '乙未': '砂石金',
      '丙申': '山下火',
      '丁酉': '山下火',
      '戊戌': '平地木',
      '己亥': '平地木',
      '庚子': '壁上土',
      '辛丑': '壁上土',
      '壬寅': '金薄金',
      '癸卯': '金薄金',
      '甲辰': '覆灯火',
      '乙巳': '覆灯火',
      '丙午': '天河水',
      '丁未': '天河水',
      '戊申': '大驿土',
      '己酉': '大驿土',
      '庚戌': '钗环金',
      '辛亥': '钗环金',
      '壬子': '桑柘木',
      '癸丑': '桑柘木',
      '甲寅': '大溪水',
      '乙卯': '大溪水',
      '丙辰': '沙中土',
      '丁巳': '沙中土',
      '戊午': '天上火',
      '己未': '天上火',
      '庚申': '石榴木',
      '辛酉': '石榴木',
      '壬戌': '大海水',
      '癸亥': '大海水',
    };
    return naYinMap['$gan$zhi'] ?? 'Unknown';
  }

  static String _getStars(String gan, String zhi) {
    const starsMap = {
      '甲子': '天德',
      '乙丑': '天德',
      '丙寅': '月德',
      '丁卯': '月德',
      '戊辰': '天赦',
      '己巳': '天赦',
      '庚午': '金匮',
      '辛未': '金匮',
      '壬申': '青龙',
      '癸酉': '青龙',
      '甲戌': '福德',
      '乙亥': '福德',
      '丙子': '天厨',
      '丁丑': '天厨',
      '戊寅': '文昌',
      '己卯': '文昌',
      '庚辰': '天官',
      '辛巳': '天官',
      '壬午': '天刑',
      '癸未': '天刑',
      '甲申': '天乙',
      '乙酉': '天乙',
      '丙戌': '太极',
      '丁亥': '太极',
      '戊子': '国印',
      '己丑': '国印',
      '庚寅': '红鸾',
      '辛卯': '红鸾',
      '壬辰': '天喜',
      '癸巳': '天喜',
      '甲午': '龙德',
      '乙未': '龙德',
      '丙申': '紫微',
      '丁酉': '紫微',
      '戊戌': '地解',
      '己亥': '地解',
      '庚子': '将星',
      '辛丑': '将星',
      '壬寅': '华盖',
      '癸卯': '华盖',
      '甲辰': '驿马',
      '乙巳': '驿马',
      '丙午': '桃花',
      '丁未': '桃花',
      '戊申': '羊刃',
      '己酉': '羊刃',
      '庚戌': '亡神',
      '辛亥': '亡神',
      '壬子': '孤辰',
      '癸丑': '孤辰',
      '甲寅': '劫煞',
      '乙卯': '劫煞',
      '丙辰': '灾煞',
      '丁巳': '灾煞',
      '戊午': '天煞',
      '己未': '天煞',
      '庚申': '地煞',
      '辛酉': '地煞',
      '壬戌': '年煞',
      '癸亥': '年煞',
    };
    return starsMap['$gan$zhi'] ?? 'Unknown';
  }

  static String calculateBazi(DateTime date, TimeOfDay time) {
    // Implement your Bazi calculation logic here
    return 'Bazi Calculation Result';
  }
}
